IdeaRS.Connections
WeldData Properties
Compatible with IDEA StatiCa 0.0
The WeldData type exposes the following members.
Properties
Name | Description
BeginOffset
EndOffset
IntermittentGap
IntermittentLength
Size
 Gets or sets the size of the weld
WeldMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from the connected member
WeldType
 Gets or sets the type of the weld
Top
See Also
Reference
WeldData Class
IdeaRS.Connections.Data Namespace